Revit 2024 API
Subelement Methods
The Subelement type exposes the following members.
Methods
Name | Description
CanHaveTypeAssigned
 Identifies if the subelement can have a type assigned.
ChangeTypeId
 Changes the type of the subelement.
Create
 Creates an object representing element or subelement.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAllParameters
 Returns all parameters of this subelement.
GetBoundingBox
 Retrieves a box that circumscribes all geometry of the subelement.
GetGeometryObject
 Retrieve one geometric primitive representing given subelement.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetParameterValue
 Obtains the current parameter value of this subelement given a parameter id.
GetReference
 Obtains the reference to this subelement.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetValidTypes
 Obtains a set of types that are valid for this subelement.
HasParameter
 Checks if this subelement have given parameter.
IsParameterModifiable
 Checks if given parameter of this subelement is modifiable.
IsValidSubelementReference
 Checks if given Reference identifies either a valid element or subelement.
IsValidType
 Checks if given type is valid for this subelement.
SetParameterValue
 Sets a new parameter value of this subelement given a parameter id.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
Subelement Class
Autodesk.Revit.DB Namespace